{
  "articles": [
    {
      "id": "1",
      "title": "Article-1",
      "body": "A proper article indicates that its noun is proper, and refers to a unique entity. It may be the name of a person, the name of a place, the name of a planet, etc. The Māori language has the proper article a, which is used for personal nouns; so, 'a Pita'  means 'Peter'. In Māori, when the personal nouns have the definite or indefinite article as an important part of it, both articles are present; for example, the phrase 'a Te Rauparaha', which contains both the proper article a and the definite article Te refers to the person name Te Rauparaha",
      "author": "Harry Potter"
    },
    {
      "id": "2",
      "title": "Article-2",
      "body": "A partitive article is a type of article, sometimes viewed as a type of indefinite article, used with a mass noun such as water, to indicate a non-specific quantity of it. Partitive articles are a class of determiner; they are used in French and Italian in addition to definite and indefinite articles. (In Finnish and Estonian, the partitive is indicated by inflection.) The nearest equivalent in English is some, although it is classified as a determiner, and English uses it less than French uses de.",
      "author": "Hermoine Granger"
    },
    {
      "id": "3",
      "title": "Article-3",
      "body": "Linguists believe the common ancestor of the Indo-European languages, Proto-Indo-European, did not have articles. Most of the languages in this family do not have definite or indefinite articles: there is no article in Latin or Sanskrit, nor in some modern Indo-European languages, such as the families of Slavic languages (except for Bulgarian and Macedonian, which are rather distinctive among the Slavic languages in their grammar, and some Northern Russian dialects[7]), Baltic languages and many Indo-Aryan languages. Although Classical Greek had a definite article (which has survived into Modern Greek and which bears strong functional resemblance to the German definite article, which it is related to), the earlier Homeric Greek used this article largely as a pronoun or demonstrative, whereas the earliest known form of Greek known as Mycenaean Greek did not have any articles. Articles developed independently in several language families.",
      "author": "Ronald Weaseley"
    }
  ]
}